Revit 2018 API
SiteLocation Class
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 18.0.0.0 (18.0.0.0)
Syntax
C#
public class SiteLocation : ElementType
Visual Basic
Public Class SiteLocation _
	Inherits ElementType
Visual C++
public ref class SiteLocation : public ElementType
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.ElementType
 Autodesk.Revit.DB.SiteLocation
See Also
SiteLocation Members
Autodesk.Revit.DB Namespace